In [1]:
import pandas as pd

In [ ]:
# Отлично! Теперь поработаем с данными о поездках на такси в Нью-Йорке,
# где также имеется информация о погодных условиях и выходных днях.  

# pickup_dt – период с точностью до часа
# pickup_month – месяц
# borough – район Нью-Йорка, из которого был сделан заказ (5 районов + аэропорт)
# pickups – число поездок за период (час)
# hday – является ли день праздничным/выходным; Y - да,  N - нет
# spd – скорость ветра в милях в час
# vsb – видимость
# temp – температура в градусах Фаренгейта
# dewp – точка росы по Фаренгейту
# slp – давление
# pcp_01 – количество осадков за час
# pcp_06 – количество осадков за 6 часов
# pcp_24 – количество осадков за 24 часа
# sd – глубина снега в дюймах
      

# Но перед тем, как приступать к работе, давайте загрузим данные. 
# На LMS путь к данным лежит в переменной path_to_file (условно, path_to_file = "/some/path/to/file.csv"). 
# Импортируйте библиотеку pandas, а затем загрузите данные по вышеупомянутой ссылке. 

# Результат сохраните в переменную taxi.

In [14]:
path_to_file = "/mnt/HC_Volume_18315164/home-jupyter/jupyter-s-kamsarin/shared/hall_of_fame/2_taxi_nyc.csv"

In [16]:
taxi = pd.read_csv(path_to_file)

In [17]:
taxi

,pickup_dt,pickup_month,borough,pickups,hday,spd,vsb,temp,dewp,slp,pcp 01,pcp 06,pcp 24,sd
0,2015-01-01 01:00:00,Jan,Bronx,152,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
1,2015-01-01 01:00:00,Jan,Brooklyn,1519,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
2,2015-01-01 01:00:00,Jan,EWR,0,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
3,2015-01-01 01:00:00,Jan,Manhattan,5258,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
4,2015-01-01 01:00:00,Jan,Queens,405,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29096,2015-06-30 23:00:00,Jun,EWR,0,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29097,2015-06-30 23:00:00,Jun,Manhattan,3828,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29098,2015-06-30 23:00:00,Jun,Queens,580,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29099,2015-06-30 23:00:00,Jun,Staten Island,0,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29100,2015-06-30 23:00:00,Jun,NaN,3,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0

In [24]:
taxi.head()

,pickup_dt,pickup_month,borough,pickups,hday,spd,vsb,temp,dewp,slp,pcp 01,pcp 06,pcp 24,sd
0,2015-01-01 01:00:00,Jan,Bronx,152,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
1,2015-01-01 01:00:00,Jan,Brooklyn,1519,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
2,2015-01-01 01:00:00,Jan,EWR,0,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
3,2015-01-01 01:00:00,Jan,Manhattan,5258,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
4,2015-01-01 01:00:00,Jan,Queens,405,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0

In [ ]:
# Проверьте, сколько всего строк и столбцов имеется в датасете.

In [18]:
taxi.shape

(29101, 14)

In [25]:
taxi.describe()

,pickups,spd,vsb,temp,dewp,slp,pcp 01,pcp 06,pcp 24,sd
count,29101.000000,29101.000000,29101.000000,29101.000000,29101.000000,29101.000000,29101.000000,29101.000000,29101.000000,29101.000000
mean,490.215903,5.984924,8.818125,47.669042,30.823065,1017.817938,0.003830,0.026129,0.090464,2.529169
std,995.649536,3.699007,2.442897,19.814969,21.283444,7.768796,0.018933,0.093125,0.219402,4.520325
min,0.000000,0.000000,0.000000,2.000000,-16.000000,991.400000,0.000000,0.000000,0.000000,0.000000
25%,1.000000,3.000000,9.100000,32.000000,14.000000,1012.500000,0.000000,0.000000,0.000000,0.000000
50%,54.000000,6.000000,10.000000,46.000000,30.000000,1018.200000,0.000000,0.000000,0.000000,0.000000
75%,449.000000,8.000000,10.000000,64.500000,50.000000,1022.900000,0.000000,0.000000,0.050000,2.958333
max,7883.000000,21.000000,10.000000,89.000000,73.000000,1043.400000,0.280000,1.240000,2.100000,19.000000

In [ ]:
# Давайте посмотрим на типы колонок. Все ли из них считались правильно?
# В качестве ответа выберите тип, преобладающий в датасете.

In [19]:
taxi.dtypes

pickup_dt        object
pickup_month     object
borough          object
pickups           int64
hday             object
spd             float64
vsb             float64
temp            float64
dewp            float64
slp             float64
pcp 01          float64
pcp 06          float64
pcp 24          float64
sd              float64
dtype: object

In [ ]:
#  В названиях столбцов pcp 01, pcp 06, pcp 24 встречается пробел. 
# Это не очень удобно, если в дальнейшем вы планируете обращаться к колонкам через точку,
# без использования кавычек и скобочек. 

# Замените пробел в названиях на знак нижнего подчеркивания. 

# Данные сохранены в переменную taxi. Данные должны быть изменены в этом же датафрейме.

In [21]:
taxi.columns

Index(['pickup_dt', 'pickup_month', 'borough', 'pickups', 'hday', 'spd', 'vsb',
       'temp', 'dewp', 'slp', 'pcp 01', 'pcp 06', 'pcp 24', 'sd'],
      dtype='object')

In [28]:
taxi = taxi.rename(columns={'pcp 01':'pcp_01', 'pcp 06':'pcp_06', 'pcp 24':'pcp_24'})

In [29]:
taxi.head()

,pickup_dt,pickup_month,borough,pickups,hday,spd,vsb,temp,dewp,slp,pcp_01,pcp_06,pcp_24,sd
0,2015-01-01 01:00:00,Jan,Bronx,152,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
1,2015-01-01 01:00:00,Jan,Brooklyn,1519,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
2,2015-01-01 01:00:00,Jan,EWR,0,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
3,2015-01-01 01:00:00,Jan,Manhattan,5258,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
4,2015-01-01 01:00:00,Jan,Queens,405,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0

In [ ]:
#Вас попросили узнать, сколько записей (строк) в датафрейме относятся к району Манхэттен (Manhattan). 
# Получить ответ на данный вопрос можно было бы, например, с помощью следующей команды:

# taxi.query("borough == 'Manhattan'").shape[0]


# А если мы хотим посмотреть, сколько раз встречается каждый из районов? 
# Неужели придется использовать подобную конструкцию для каждого уровня переменной? 
# Здесь на помощь приходит метод value_counts(), подробнее о котором можно почитать в конспекте! 

# Сколько раз в данных встречается район Бруклин (Brooklyn)?

In [36]:
taxi.query("borough == 'Manhattan'").shape[0]

4343

In [37]:
taxi.query("borough == 'Brooklyn'").shape[0]

4343

In [39]:
taxi.query("borough == 'Queens'").shape[0]

4343

In [40]:
taxi.value_counts("borough")

borough
Staten Island    4343
Queens           4343
Manhattan        4343
EWR              4343
Brooklyn         4343
Bronx            4343
dtype: int64

In [ ]:
# Как то не специально решил двумя вариантами ))

In [42]:
taxi['borough'].value_counts()

Bronx            4343
EWR              4343
Staten Island    4343
Manhattan        4343
Brooklyn         4343
Queens           4343
Name: borough, dtype: int64

In [ ]:
# Следующая задача: выяснить, из какого района было совершено наибольшее количество поездок за весь период. 
# Для начала, посчитайте общее количество поездок (pickups), без группировки.

In [43]:
taxi.pickups.sum()

14265773

In [ ]:
# А теперь сгруппируйте данные по району (borough) и укажите, из какого пункта было совершено больше всего поездок.

In [102]:
taxi.groupby('borough',as_index = False ).agg({'pickups': 'sum'}).sort_values('pickups', ascending = False)

         borough   pickups
3      Manhattan  10367841
1       Brooklyn   2321035
4         Queens   1343528
0          Bronx    220047
5  Staten Island      6957
2            EWR       105

In [ ]:
# Еще несколько полезных методов в pandas! Возможно, 
# в предыдущем степе вы просто посмотрели на данные или отсортировали значения.
# Ускорить данный процесс в дальнейшем помогут методы idxmin() и idxmax(),
# которые возвращают индекс минимального или максимального значения.

# idxmin – индекс минимального значения
# idxmax – индекс максимального значения
# Сохраните название района с наименьшим числом поездок в переменную min_pickups, применив подходящий метод.

In [77]:
taxi_borough = taxi.groupby('borough').agg({'pickups': 'sum'})

In [78]:
taxi_borough

                pickups
borough
Bronx            220047
Brooklyn        2321035
EWR                 105
Manhattan      10367841
Queens          1343528
Staten Island      6957

In [79]:
min_pickups = taxi_borough.idxmin()

In [80]:
min_pickups

pickups    EWR
dtype: object

In [ ]:
# пробуем все укоротить

In [81]:
min_pickups = taxi.groupby('borough').agg({'pickups': 'sum'}).idxmin()

In [82]:
min_pickups

pickups    EWR
dtype: object

In [ ]:
# Продолжим изучение данных и посмотрим на число поездок в выходные дни. 
# Сгруппируйте данные по двум признакам: району города и является ли день выходным (колонки borough и hday).
#     Сравните среднее число поездок, и выберите районы,
#     из которых по праздникам в среднем поступает больше заказов, чем в обычные дни.

In [83]:
taxi.head()

,pickup_dt,pickup_month,borough,pickups,hday,spd,vsb,temp,dewp,slp,pcp_01,pcp_06,pcp_24,sd
0,2015-01-01 01:00:00,Jan,Bronx,152,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
1,2015-01-01 01:00:00,Jan,Brooklyn,1519,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
2,2015-01-01 01:00:00,Jan,EWR,0,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
3,2015-01-01 01:00:00,Jan,Manhattan,5258,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
4,2015-01-01 01:00:00,Jan,Queens,405,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0

In [92]:
taxi.groupby(['borough','hday']).agg({'pickups': 'mean'})

                        pickups
borough       hday
Bronx         N       50.771073
              Y       48.065868
Brooklyn      N      534.727969
              Y      527.011976
EWR           N        0.023467
              Y        0.041916
Manhattan     N     2401.302921
              Y     2035.928144
Queens        N      308.899904
              Y      320.730539
Staten Island N        1.606082
              Y        1.497006

In [ ]:
#  ответ в ручную вывел EWR и Queens

In [ ]:
# Для каждого района посчитайте число поездок по месяцам. 
# Отсортируйте полученные значения по убыванию и сохраните результирующий датафрейм в pickups_by_mon_bor.

# Обратите внимание, что итоговый датасет должен состоять из 3-х колонок - pickup_month, borough, pickups.

In [103]:
pickups_by_mon_bor = taxi.groupby(['pickup_month','borough'],as_index = False).agg({'pickups': 'sum'}).sort_values('pickups', ascending = False)

In [104]:
pickups_by_mon_bor.head()

   pickup_month    borough  pickups
21          Jun  Manhattan  1995388
33          May  Manhattan  1888800
9           Feb  Manhattan  1718571
27          Mar  Manhattan  1661261
3           Apr  Manhattan  1648278

In [ ]:
# 💀 Сложное задание! 💀

# Теперь задача посложнее! Попрактикуемся в написании собственных функций и их применении к датафрейму.
# Поскольку данные о поездках в Нью-Йорке, температура представлена в градусах Фаренгейта. 

# Напишите функцию temp_to_celcius, которая получает на вход колонку с температурой в °F,
# и возвращает значения, переведенные в градусы Цельсия.

# Формула:

#  Celsius = \frac{(Fahrenheit-32) \cdot 5.0}{9.0}Celsius= 
# 9.0
# (Fahrenheit−32)⋅5.0
# ​
 

# Пример работы функции:

# > taxi['temp'][:5]

# 0    30.0
# 1    30.0
# 2    30.0
# 3    30.0
# 4    30.0

# > taxi['temp_C'] = temp_to_celcius(taxi['temp'])
# > taxi['temp_C'][:5]

# 0   -1.111111
# 1   -1.111111
# 2   -1.111111
# 3   -1.111111
# 4   -1.111111

In [105]:
 taxi['temp'][:5]

0    30.0
1    30.0
2    30.0
3    30.0
4    30.0
Name: temp, dtype: float64

In [106]:
def temp_to_celcius(temp):
    temp_f_to_c = (temp - 32) * 5 / 9
    return temp_f_to_c

In [107]:
taxi['temp_C'] = temp_to_celcius(taxi['temp'])

In [108]:
taxi['temp_C'][:5]

0   -1.111111
1   -1.111111
2   -1.111111
3   -1.111111
4   -1.111111
Name: temp_C, dtype: float64

In [ ]:
# Все получилось )) двигаемся дальше !!